Install pandas

In [ ]:
%pip install pandas

Requirement already satisfied: pandas in c:\users\chach\documents\github\advance_prog\venv\lib\site-packages (3.0.0)
Requirement already satisfied: numpy>=1.26.0 in c:\users\chach\documents\github\advance_prog\venv\lib\site-packages (from pandas) (2.4.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\chach\documents\github\advance_prog\venv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: tzdata in c:\users\chach\documents\github\advance_prog\venv\lib\site-packages (from pandas) (2025.3)
Requirement already satisfied: six>=1.5 in c:\users\chach\documents\github\advance_prog\venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

[notice] A new release of pip is available: 24.0 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

Create a DataFrame

In [19]:
import pandas as pd

data = {
    "Name": ["Mansur", "Daniya", "Arailym", "Ramazan", "Artyom"],
    "Age": [19, 21, 20, 17, 18],
    "Score": [85, 92, 78, 100, 95]
}

df = pd.DataFrame(data)

df

      Name  Age  Score
0   Mansur   19     85
1   Daniya   21     92
2  Arailym   20     78
3  Ramazan   17    100
4   Artyom   18     95

Data Exploration

Display first 3 rows

In [20]:
df.head(3)

      Name  Age  Score
0   Mansur   19     85
1   Daniya   21     92
2  Arailym   20     78

Summary statistics

In [21]:
df.describe()

             Age       Score
count   5.000000    5.000000
mean   19.000000   90.000000
std     1.581139    8.631338
min    17.000000   78.000000
25%    18.000000   85.000000
50%    19.000000   92.000000
75%    20.000000   95.000000
max    21.000000  100.000000

Average score

In [22]:
average_score = df["Score"].mean()
print(average_score)

90.0

Data Filtering

Students older than 20

In [23]:
older_than_20 = df[df["Age"] > 20]
older_than_20

     Name  Age  Score
1  Daniya   21     92

Students with score above 80

In [24]:
score_above_80 = df[df["Score"] > 80]
score_above_80

      Name  Age  Score
0   Mansur   19     85
1   Daniya   21     92
3  Ramazan   17    100
4   Artyom   18     95

In [25]:
df.to_csv("students.csv", index=False)